{"data":{"site":{"siteMetadata":{"title":"Sbanken praksis blog","author":"Peder Wiig Aalen"}},"markdownRemark":{"id":"0ba3defa-a243-5846-907f-102343a539f9","excerpt":"Mandag Starter mandagen med å finne ut av mer hvordan vi skal få løse problemet med at ikke alle skjermlesere støtter noen attributter i html. Utover dagen ble…","html":"<h3>Mandag</h3>\n<p>Starter mandagen med å finne ut av mer hvordan vi skal få løse problemet med at ikke alle skjermlesere støtter noen attributter i html. Utover dagen ble det jobbing med de nye junior utviklerne som ble ansatt i desember. De hadde et par problemer med versjonshånderingsverktøyet git. Som man ikke lærer så mye om på skolen. Det ble et lynkurs i git og andre generelle saker i nettbanken.</p>\n<h3>Tirsdag - Refaktoring</h3>\n<p>I dag har jeg jobbet med gammel kode i nettbanken som ikke er optimalisert for skjermlesere. Det har vært knotete og frustrerende til tider, men er kommet nærmere målet. Problemer som dette er vanskelig å rette opp i fordi kodebasen ikke er vedlikeholdbar. Det tar lengre tid å finne ut av hvordan man løser problemet. Man har begrensninger for hva man kan gjøre på gammel teknologi. Derfor blir løsningene ofte ikke så gode, men mer som en «hack» - Det fungerer, men er ikke fint.</p>\n<p>Det kan av og til være enklere å scratche det meste av koden og lage ny kode på ny teknologi. Men det var ikke målet i dag.</p>\n<h3>Fredag - Teambuilding</h3>\n<p>Idag har jeg jobbet med å ferdigstille siste justeringene på universellutforming. Jeg og Jocef parprogrammerte frem til lunsj. Vi har jobbet med å legge til validering i jquery`s unobtrusive validering. Lager man egendefinerte feilmeldinger til attributter i .NET må man legge det manuelt til jquery. For at scripted skal forstå hva det skal gjøre.</p>\n<p>Da var det lunsj og nå skal vi ut å teambuilde de nye juniorene. Det er opplegg fra 12 til 22! Vi skal først ut på iskanten å spille curling, deretter skal vi spise på bjerk å så videre til en bar hvor vi lar resten av kvelden spille ut. Dette blir en knall dag, snakkes!</p>","frontmatter":{"title":"Uke 4 – Forsetter med UU","date":"January 21, 2019"}}},"pageContext":{"slug":"/uke-4/","previous":{"fields":{"slug":"/uke-3/"},"frontmatter":{"title":"Uke 3 – Nytt team"}},"next":{"fields":{"slug":"/uke-5/"},"frontmatter":{"title":"Uke 5 – Nye muligheter"}}}}