{"data":{"site":{"siteMetadata":{"title":"Sbanken praksis blog","author":"Peder Wiig Aalen"}},"markdownRemark":{"id":"4da5f89b-f511-5582-99b9-46316c2b82ce","excerpt":"Tirsdag Denne uken har vi lagt de siste universell utformingsoppgavene på hyllen og startet på nye oppgaver. Jocef og jeg har valgt å parprogrammere for å takle…","html":"<h3>Tirsdag</h3>\n<p>Denne uken har vi lagt de siste universell utformingsoppgavene på hyllen og startet på nye oppgaver. Jocef og jeg har valgt å parprogrammere for å takle de nye utfordringene sammen. Vi valgte en oppgave fra jira boardet. Jira er et verktøy for arbeidsflyt som vi bruker for å definere oppgaver som skal gjøres i banken. Oppgaven vi valgte omhandlet saksbehandlingssystemet i banken. Her kommer alle søknader om lån inn. Systemet er gammelt og veldig stort. Veiledning var det første vi trengte. Derfor spurte vi om hjelp fra en av de som har vært med å utvikle systemet. Etter en liten innføring fikk vi oversikt over hva vi skulle gjøre og resulterte i at vi fikk sjekket inn oppgaven. </p>\n<h3>Onsdag</h3>\n<p>Startet vi dagen med et møte om hvordan vi skulle jobbe sammen på de oppgavene fremover. Etter møte hadde vi en stand-up med junior-utviklerene. Stand-up er blir praktisert i noen team i banken. Hver dag kl 10 holdes det et uformelt møte i ca 10 minutter. Her informeres det om hva som er på dagsorden og hva utviklere jobber med. Stand-up er en god måte å formidle informasjon uten å innkalle til møte.\nEtter møtet hadde noen på teamet vårt hatt en release som produserte en del feilmeldinger i produksjon og måtte da foreta en rollback til forige versjon av nettbanken. Var kult å se på monitorerings programmet som overvåker alt i nettbanken. Her kan man se hva som går gale og hvilke feilmeldinger som blir produsert.\nArbeidsdagen er over og da tar jeg en god lang helg! God helg!</p>","frontmatter":{"title":"Uke 5 – Nye muligheter","date":"January 28, 2019"}}},"pageContext":{"slug":"/uke-5/","previous":{"fields":{"slug":"/uke-4/"},"frontmatter":{"title":"Uke 4 – Forsetter med UU"}},"next":{"fields":{"slug":"/uke-6/"},"frontmatter":{"title":"Uke 5"}}}}